Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult
Possible results from invoking the FabricationNetworkChangeService.
Since:
2018.2
Since:
2018.2

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult.InvalidSelection
The selection of elements was invalid.

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult.UserAborted
The change was aborted by the user.

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult.PartialFailure
The change contained partial failures and will need to be fixed manually.

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult.Success
The change was successful.